Revit 2027 API
ExternalServices.BuiltInExternalServices.AXMImporterService Property
Note: This API is now obsolete.
 The external service which permits registration of an alternate implementation for AXM import.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This value is deprecated in Revit 2027 and may be removed in a later version of Revit.")]
public static ExternalServiceId AXMImporterService { get; }
<ObsoleteAttribute("This value is deprecated in Revit 2027 and may be removed in a later version of Revit.")>
Public Shared ReadOnly Property AXMImporterService As ExternalServiceId
	Get
public:
[ObsoleteAttribute(L"This value is deprecated in Revit 2027 and may be removed in a later version of Revit.")]
static property ExternalServiceId^ AXMImporterService {
	ExternalServiceId^ get ();
}
[<ObsoleteAttribute("This value is deprecated in Revit 2027 and may be removed in a later version of Revit.")>]
static member AXMImporterService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace